#include <iostream>
#include <ctime>
using namespace std;

int main()
{
	int h1, h2, h3, m1, m2, m3, s1, s2, s3;
	setlocale(LC_ALL, "Rus");
	cout << "Введите начало временного промежутка(через пробел часы, минуты, секунды) ";
	cin >> h1 >> m1 >> s1;
	cout << "Введите конец временного промежутка(через пробел часы, минуты, секунды) ";
	cin >> h2 >> m2 >> s2;
	if ((h2 < h1) || (m1 >= 60) || (m2 >= 60) || (s1 >= 60) || (s2 >= 60))
	{
		cout << "Неправильный ввод, повторите попытку"<< endl;
		cout << "Введите начало временного промежутка(через пробел часы, минуты, секунды) ";
		cin >> h1 >> m1 >> s1;
		cout << "Введите конец временного промежутка(через пробел часы, минуты, секунды) ";
		cin >> h2 >> m2 >> s2;
	}
	h3 = h2 - h1;
	if (m2>m1)
	{
		m3 = m2 - m1;
	}
	else
	{
		h3 = h3 - 1;
		m3 = 60 + m2 - m1;
	}
	if (s2 > s1)
	{
		s3 = s2 - s1;
	}
	else
	{
		m3 = m3 - 1;
		s3 = 60 + s2 - s1;
	}
	cout << " Продолжительность промежутка: " << h3 << "ч." << m3 << "мин." << s3 << "сек.";
	return 0;
}

